# Taps
tap "weaveworks/tap"

# Core CLI (not managed by devbox)
brew "mas"
brew "bash-completion"
brew "curl"
brew "ffmpeg"
brew "git"
brew "nushell"
brew "nvm"
brew "wget"
brew "zsh-history-substring-search"

# Cloud & Infrastructure (not managed by devbox)
brew "ansible"
brew "argocd"
brew "aws-nuke"
brew "weaveworks/tap/eksctl"
brew "go-task"
brew "helm"
brew "skaffold"
brew "trufflehog"

# Languages & Runtimes
brew "go"
brew "pipx"
brew "pnpm"
brew "poetry"
brew "python@3.14"

# Security & Git
brew "bfg"
brew "gitleaks"
brew "tailscale"

# Data
brew "postgresql@17"

# Media
brew "youtube-dl"

# Casks
cask "1password"
cask "claude"
cask "cmux"
cask "dbeaver-community"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "miniconda"
cask "nordvpn"
cask "obsidian"
cask "session-manager-plugin"
cask "visual-studio-code"
cask "zoom"

## Work Applications
cask "microsoft-outlook"
cask "microsoft-teams"
cask "slack"
