amazonwebservices.aws-toolkit-vscode
anthropic.claude-code
aws-scripting-guy.cform
batisteo.vscode-django
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
docker.docker
donjayamanne.githistory
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-rename-tag
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
hashicorp.hcl
hashicorp.terraform
inferrinizzard.prettier-sql-vscode
janisdd.vscode-edit-csv
kddejong.vscode-cfn-lint
kevinrose.vsc-python-indent
mechatroner.rainbow-csv
mikestead.dotenv
mohsen1.prettify-json
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.js-debug-nightly
ms-vscode.makefile-tools
njpwerner.autodocstring
openai.chatgpt
orta.vscode-jest
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
streetsidesoftware.code-spell-checker
ue.alphabetical-sorter
visualstudioexptteam.vscodeintellicode
vscjava.migrate-java-to-azure
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
wholroyd.jinja
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
